import request from '@/plugin/axios/axios';
import { AxiosPromise } from 'axios';

/**
 *  发布朋友圈
 *
 *  @description 参数说明如下
 *  userId已经加入到axios中可不去传入，* 毕传项
 *  +-----------------------------------------------------------------|
 *  | userId *  |  用户ID           |  String      |      044....sda
 *  |-----------------------------------------------------------------|
 *  | content   |  上传的内容        |  String      |     'hello world'
 *  |-----------------------------------------------------------------|
 *  | x         |  经度             |  String      |        '208'
 *  |-----------------------------------------------------------------|
 *  | y         |  纬度             |  String      |        '208'
 *  |-----------------------------------------------------------------|
 *  | address   |  地址             |  String      |     '今天发的东西'
 *  |-----------------------------------------------------------------|
 *  | files     |  图片或者视频附件   |  Array       |        [{},{}]
 *  +-----------------------------------------------------------------|
 *  @returns {AxiosPromise}
 */
export const AsyncPublish = (data?: any): AxiosPromise => {
  return request({
    url: `pyq/publish`,
    method: 'post',
    data,
  });
};
